templates/medium/cxf-contract-first/medium-fuse-cxf-contract-first-blueprint/src/test/resources/generated.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://com.mycompany.camel.ws">
   <soapenv:Header/>
   <soapenv:Body>
      <com:order>
         <com:customer id="A0001">
            <name>Antwerp Zoo</name>
            <city>Antwerp</city>
            <country>UK</country>
         </com:customer>
         <com:date>2012-03-01</com:date>
         <com:orderlines>
            <!--1 or more repetitions:-->
            <com:orderline>
               <article id="A0001">
               <description>Aardvark</description>
               </article>
               <quantity>1</quantity>
            </com:orderline>
            <com:orderline>
               <article id="A0011">
                   <description>Alpaca</description>
               </article>
               <quantity>10</quantity>
            </com:orderline>
         </com:orderlines>
      </com:order>
   </soapenv:Body>
</soapenv:Envelope>
