templates/medium/cxf-contract-first/medium-fuse-cxf-contract-first-blueprint/src/test/resources/generated-old.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header/>
  <soap:Body>
    <ns2:order xmlns:ns2="http://com.mycompany.camel.ws">
      <ns2:customer id="A0001">
        <name>Antwerp Zoo</name>
        <city>Antwerp</city>
        <country>BE</country>
      </ns2:customer>
      <ns2:date>2012-03-01</ns2:date>
      <ns2:orderlines>
        <ns2:orderline>
          <article id="A0001">
            <description>Aardvark</description>
          </article>
          <quantity>1</quantity>
        </ns2:orderline>
        <ns2:orderline>
          <article id="A0011">
            <description>Alpaca</description>
          </article>
          <quantity>10</quantity>
        </ns2:orderline>
      </ns2:orderlines>
    </ns2:order>
  </soap:Body>
</soap:Envelope>
